---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextDistToLine
source: html/5c7871e8-778c-3c08-58c0-97a8d01bd308.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextDistToLine Property

"Text Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId TextDistToLine { get; }
```